In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('StudentsPerformance.csv')

# 1. Find out how many males and females participated in the test.

In [3]:
print("Number of females =",df['gender'].value_counts()['female'])
print("Number of males =",df['gender'].value_counts()['male'])

Number of females = 518
Number of males = 482

# 2.What do you think about the students' parental level of education?

In [4]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

# Who scores the most on average for math, reading and writing based on
#Gender #Test preparation course

In [5]:
df.groupby('gender').agg(mean_math_score=('math score', 'mean'),mean_reading_score=('reading score', 'mean'),mean_writing_score=('writing score', 'mean'))

        mean_math_score  mean_reading_score  mean_writing_score
gender
female        63.376448           72.590734           72.467181
male          68.821577           65.545643           63.446058

In [6]:
df.groupby('test preparation course').agg(mean_math_score=('math score', 'mean'),mean_reading_score=('reading score', 'mean'),mean_writing_score=('writing score', 'mean'))

,mean_math_score,mean_reading_score,mean_writing_score
test preparation course,,,
completed,69.96648,74.175978,74.684358
none,63.78972,66.417445,64.457944

# What do you think about the scoring variation for math, reading and writing based on
#● Gender #● Test preparation course

In [9]:
df.groupby('test preparation course').agg(SD_math_score=('math score', 'std'),SD_reading_score=('reading score', 'std'),SD_writing_score=('writing score', 'std'))

                         SD_math_score  SD_reading_score  SD_writing_score
test preparation course
completed                    14.521847         13.537572         13.236412
none                         15.705689         14.608896         15.041667

In [10]:
df.groupby('gender').agg(SD_math_score=('math score', 'std'),SD_reading_score=('reading score', 'std'),SD_writing_score=('writing score', 'std'))

        SD_math_score  SD_reading_score  SD_writing_score
gender
female      16.029928         14.411018         14.844842
male        14.556411         14.149594         14.227225

# The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [12]:
df['math score'].count()

1000

In [11]:
df.nlargest(250,'math score')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62